# Bonus: Temperature Analysis I

In [87]:
import pandas as pd
from datetime import datetime as dt
from numpy import mean

In [88]:
# "tobs" is "temperature observations"
df = pd.read_csv('Resources/hawaii_measurements.csv')
df.head()

       station        date  prcp  tobs
0  USC00519397  2010-01-01  0.08    65
1  USC00519397  2010-01-02  0.00    63
2  USC00519397  2010-01-03  0.00    74
3  USC00519397  2010-01-04  0.00    76
4  USC00519397  2010-01-06   NaN    73

In [89]:
# Convert the date column format from string to datetime
df['date']=pd.to_datetime(df['date'])

In [90]:
# Set the date column as the DataFrame index
date_index= df.set_index('date')
date_index.head()

                station  prcp  tobs
date
2010-01-01  USC00519397  0.08    65
2010-01-02  USC00519397  0.00    63
2010-01-03  USC00519397  0.00    74
2010-01-04  USC00519397  0.00    76
2010-01-06  USC00519397   NaN    73

In [91]:
# Drop the date column
no_date=df.drop(['date'],axis=1)
no_date.head()

       station  prcp  tobs
0  USC00519397  0.08    65
1  USC00519397  0.00    63
2  USC00519397  0.00    74
3  USC00519397  0.00    76
4  USC00519397   NaN    73

### Compare June and December data across all years

In [171]:
from scipy import stats
import warnings
warnings.filterwarnings('ignore')

In [172]:
# Filter data for desired months(June)
temp_june=df.loc[df['date'].dt.month==6]
june_df=pd.DataFrame(temp_june,columns=["date","tobs"])
june_df

            date  tobs
133   2010-06-01    78
134   2010-06-02    76
135   2010-06-03    78
136   2010-06-04    76
137   2010-06-05    77
...          ...   ...
19492 2017-06-26    79
19493 2017-06-27    74
19494 2017-06-28    74
19495 2017-06-29    76
19496 2017-06-30    75

[1700 rows x 2 columns]

In [173]:
temp_dec=df.loc[df['date'].dt.month==12]
dec_df=pd.DataFrame(temp_dec,columns=["date","tobs"])
dec_df

            date  tobs
305   2010-12-01    76
306   2010-12-03    74
307   2010-12-04    74
308   2010-12-06    64
309   2010-12-07    64
...          ...   ...
19323 2016-12-27    71
19324 2016-12-28    71
19325 2016-12-29    69
19326 2016-12-30    65
19327 2016-12-31    65

[1517 rows x 2 columns]

In [174]:
# Identify the average temperature for June
avg_june=june_df['tobs'].mean()
avg_june

74.94411764705882

In [175]:
# Identify the average temperature for December
avg_dec = dec_df.mean()
avg_dec

tobs    71.041529
dtype: float64